GunicornRedisGeventTornado/tsung/tsung-template.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<tsung loglevel="warning" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="client1" cpu="2" maxusers="800">
    	<ip value="11.0.1.1"></ip>
    	<ip value="11.0.1.2"></ip>
    	<ip value="11.0.1.3"></ip>
    	<ip value="11.0.1.4"></ip>
	<ip value="11.0.1.5"></ip>
	<ip value="11.0.1.6"></ip>
	<ip value="11.0.1.7"></ip>
	<ip value="11.0.1.8"></ip>
	<ip value="11.0.1.9"></ip>
	<ip value="11.0.1.10"></ip>
	<ip value="11.0.1.11"></ip>
	<ip value="11.0.1.12"></ip>
	<ip value="11.0.1.13"></ip>
	<ip value="11.0.1.14"></ip>
	<ip value="11.0.1.15"></ip>
	<ip value="11.0.1.16"></ip>
	<ip value="11.0.1.17"></ip>
	<ip value="11.0.1.18"></ip>
	<ip value="11.0.1.19"></ip>
	<ip value="11.0.1.20"></ip>
	<ip value="11.0.1.21"></ip>
	<ip value="11.0.1.22"></ip>
	<ip value="11.0.1.23"></ip>
	<ip value="11.0.1.24"></ip>
	<ip value="11.0.1.25"></ip>
	<ip value="11.0.1.26"></ip>
	<ip value="11.0.1.27"></ip>
	<ip value="11.0.1.28"></ip>
	<ip value="11.0.1.29"></ip>
	<ip value="11.0.1.30"></ip>
	<ip value="11.0.1.31"></ip>
	<ip value="11.0.1.32"></ip>
	<ip value="11.0.1.33"></ip>
	<ip value="11.0.1.34"></ip>
	<ip value="11.0.1.35"></ip>
	<ip value="11.0.1.36"></ip>
	<ip value="11.0.1.37"></ip>
	<ip value="11.0.1.38"></ip>
	<ip value="11.0.1.39"></ip>
	<ip value="11.0.1.40"></ip>
	<ip value="11.0.1.41"></ip>
	<ip value="11.0.1.42"></ip>
	<ip value="11.0.1.43"></ip>
	<ip value="11.0.1.44"></ip>
	<ip value="11.0.1.45"></ip>
	<ip value="11.0.1.46"></ip>
	<ip value="11.0.1.47"></ip>
	<ip value="11.0.1.48"></ip>
	<ip value="11.0.1.50"></ip>
    </client>
    <client host="client2" cpu="2" maxusers="800">
    	<ip value="11.0.2.1"></ip>
    	<ip value="11.0.2.2"></ip>
    	<ip value="11.0.2.3"></ip>
    	<ip value="11.0.2.4"></ip>
	<ip value="11.0.2.5"></ip>
	<ip value="11.0.2.6"></ip>
	<ip value="11.0.2.7"></ip>
	<ip value="11.0.2.8"></ip>
	<ip value="11.0.2.9"></ip>
	<ip value="11.0.2.10"></ip>
	<ip value="11.0.2.11"></ip>
	<ip value="11.0.2.12"></ip>
	<ip value="11.0.2.13"></ip>
	<ip value="11.0.2.14"></ip>
	<ip value="11.0.2.15"></ip>
	<ip value="11.0.2.16"></ip>
	<ip value="11.0.2.17"></ip>
	<ip value="11.0.2.18"></ip>
	<ip value="11.0.2.19"></ip>
	<ip value="11.0.2.20"></ip>
	<ip value="11.0.2.21"></ip>
	<ip value="11.0.2.22"></ip>
	<ip value="11.0.2.23"></ip>
	<ip value="11.0.2.24"></ip>
	<ip value="11.0.2.25"></ip>
	<ip value="11.0.2.26"></ip>
	<ip value="11.0.2.27"></ip>
	<ip value="11.0.2.28"></ip>
	<ip value="11.0.2.29"></ip>
	<ip value="11.0.2.30"></ip>
	<ip value="11.0.2.31"></ip>
	<ip value="11.0.2.32"></ip>
	<ip value="11.0.2.33"></ip>
	<ip value="11.0.2.34"></ip>
	<ip value="11.0.2.35"></ip>
	<ip value="11.0.2.36"></ip>
	<ip value="11.0.2.37"></ip>
	<ip value="11.0.2.38"></ip>
	<ip value="11.0.2.39"></ip>
	<ip value="11.0.2.40"></ip>
	<ip value="11.0.2.41"></ip>
	<ip value="11.0.2.42"></ip>
	<ip value="11.0.2.43"></ip>
	<ip value="11.0.2.44"></ip>
	<ip value="11.0.2.45"></ip>
	<ip value="11.0.2.46"></ip>
	<ip value="11.0.2.47"></ip>
	<ip value="11.0.2.48"></ip>
	<ip value="11.0.2.49"></ip>
	<ip value="11.0.2.50"></ip>
    </client>
    <client host="client3" cpu="2" maxusers="800">
    	<ip value="11.0.3.1"></ip>
    	<ip value="11.0.3.2"></ip>
    	<ip value="11.0.3.3"></ip>
    	<ip value="11.0.3.4"></ip>
	<ip value="11.0.3.5"></ip>
	<ip value="11.0.3.6"></ip>
	<ip value="11.0.3.7"></ip>
	<ip value="11.0.3.8"></ip>
	<ip value="11.0.3.9"></ip>
	<ip value="11.0.3.10"></ip>
	<ip value="11.0.3.11"></ip>
	<ip value="11.0.3.12"></ip>
	<ip value="11.0.3.13"></ip>
	<ip value="11.0.3.14"></ip>
	<ip value="11.0.3.15"></ip>
	<ip value="11.0.3.16"></ip>
	<ip value="11.0.3.17"></ip>
	<ip value="11.0.3.18"></ip>
	<ip value="11.0.3.19"></ip>
	<ip value="11.0.3.20"></ip>
	<ip value="11.0.3.21"></ip>
	<ip value="11.0.3.22"></ip>
	<ip value="11.0.3.23"></ip>
	<ip value="11.0.3.24"></ip>
	<ip value="11.0.3.25"></ip>
	<ip value="11.0.3.26"></ip>
	<ip value="11.0.3.27"></ip>
	<ip value="11.0.3.28"></ip>
	<ip value="11.0.3.29"></ip>
	<ip value="11.0.3.30"></ip>
	<ip value="11.0.3.31"></ip>
	<ip value="11.0.3.32"></ip>
	<ip value="11.0.3.33"></ip>
	<ip value="11.0.3.34"></ip>
	<ip value="11.0.3.35"></ip>
	<ip value="11.0.3.36"></ip>
	<ip value="11.0.3.37"></ip>
	<ip value="11.0.3.38"></ip>
	<ip value="11.0.3.39"></ip>
	<ip value="11.0.3.40"></ip>
	<ip value="11.0.3.41"></ip>
	<ip value="11.0.3.42"></ip>
	<ip value="11.0.3.43"></ip>
	<ip value="11.0.3.44"></ip>
	<ip value="11.0.3.45"></ip>
	<ip value="11.0.3.46"></ip>
	<ip value="11.0.3.47"></ip>
	<ip value="11.0.3.48"></ip>
	<ip value="11.0.3.49"></ip>
	<ip value="11.0.3.50"></ip>
    </client>
  </clients>
  
  <!-- Server side setup -->
<servers>
  <server host="server" port="5000" type="tcp" />
</servers>

  <!-- to start os monitoring (cpu, network, memory). Use an erlang
  agent on the remote machine or SNMP. erlang is the default --> 
  <monitoring>
    <monitor host="server" type="erlang"></monitor>
    <monitor host="redis" type="erlang"></monitor>
    <monitor host="client1" type="erlang"></monitor>
    <monitor host="client2" type="erlang"></monitor>
    <monitor host="client3" type="erlang"></monitor>
  </monitoring>
  
  <load duration="210" unit="second">
  <!-- several arrival phases can be set: for each phase, you can set
  the mean inter-arrival time between new clients and the phase
  duration -->
   <arrivalphase phase="1" duration="10" unit="second">
     <users maxnumber="1000" arrivalrate="100" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="2" duration="10" unit="second">
     <users maxnumber="2000" arrivalrate="200" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="3" duration="10" unit="second">
     <users maxnumber="3000" arrivalrate="300" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="4" duration="10" unit="second">
     <users maxnumber="4000" arrivalrate="400" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="10" unit="second">
     <users maxnumber="5000" arrivalrate="500" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="10" unit="second">
     <users maxnumber="6000" arrivalrate="600" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="10" unit="second">
     <users maxnumber="7000" arrivalrate="700" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="8" duration="10" unit="second">
     <users maxnumber="8000" arrivalrate="800" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="10" unit="second">
     <users maxnumber="9000" arrivalrate="900" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="10" unit="second">
     <users maxnumber="10000" arrivalrate="1000" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="11" duration="10" unit="second">
     <users maxnumber="11000" arrivalrate="1100" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="12" duration="10" unit="second">
     <users maxnumber="12000" arrivalrate="1200" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="13" duration="10" unit="second">
     <users maxnumber="13000" arrivalrate="1300" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="14" duration="10" unit="second">
     <users maxnumber="14000" arrivalrate="1400" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="15" duration="10" unit="second">
     <users maxnumber="15000" arrivalrate="1500" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="16" duration="10" unit="second">
     <users maxnumber="16000" arrivalrate="1600" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="17" duration="10" unit="second">
     <users maxnumber="17000" arrivalrate="1700" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="18" duration="10" unit="second">
     <users maxnumber="18000" arrivalrate="1800" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="19" duration="10" unit="second">
     <users maxnumber="19000" arrivalrate="1900" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="20" duration="10" unit="second">
     <users maxnumber="20000" arrivalrate="2000" unit="second"></users>
   </arrivalphase>
  </load>
  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
   </option>
   <option name="ports_range" min="1025" max="65535"/>
  </options>

  <!-- start a session for a http user. the probability is the
  frequency of this type os session. The sum of all session's
  probabilities must be 100 -->

 <sessions>
  <session name="http-example" probability="100" type="ts_http">

    <!-- full url with server name, this overrides the "server" config value -->
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
    <request> <http url="/" method="GET" version="1.0"></http> </request>
  </session>
 
 </sessions>
</tsung>